namespace Bw.Entities.Network.Ticks
{
    //Фазы тика по порядку (порядок значений = порядок в тике. перестановка меняет игру!!).
    public enum TickPhase
    {
        //То, что происходит до тика
        //(чтение и отправка ввода клиента, чтение сообщений с сервера)
        Prepare,

        //Подготовка к шагу физики
        //(задаётся то, что шаг физики должен учесть в этом тике (скорости, силы, импульсы, телепорты тел, etc))
        BeforePhysics,

        //Шаг физики (Box2D)
        Physics,

        //Всё, что не подготавливает физику, и чему не требуется готовый мир
        //(движение персонажей по вводу, регенерация здоровья, таймеры, etc)
        Default,

        //Взаимодействия, которым нужен готовый мир этого тика (выстрелы, удары, броски, etc)
        Late,

        //После шага: мир полностью финализирован (readonly), рассылка состояний с сервера
        Publish
    }
}
